request_.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:zan="ZANTAZ_StoreAndRetrieveService">
   <soapenv:Header/>
   <soapenv:Body>
      <zan:retrieveEnrichedDocument soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <pKey xsi:type="xsd:string">1.1,rBJX7jHyCNYOX-hZv5nbH8GfYvyxLPRxPdRO7tnxPWnWRE0U6pooTQmwH4wg4XnKQv2LClME2AB_fnMxXa44vtF4hNSKcy-58caOo_VJaA3D-8MCaBERqUCgVRS2dqD8prpu5ztdWjijWQMj_3h77vsZ4rdmjcT94jMJ-baLJFqYIydELslM41h6INiggeqxtI5CMvyo42Af93dgxqPQjBtjC7CqImWzffI5gGZyPKDDEBhOQrmXFw==</pKey>
         <domainName xsi:type="xsd:string">testdomain2</domainName>
      </zan:retrieveEnrichedDocument>
   </soapenv:Body>
</soapenv:Envelope>